import React from "react";

export const HeadlightRequestDescription = () => (
    <>
        <div>
            Дополнительные работы, необходимость в которых может возникнуть в процессе исполнения Заказа, их <br />
            стоимость и сроки выполнения Исполнитель согласовывает с Заказчиком/Представителем устно и/или <br />
            письменно с последующим отражением в документе, подтверждающий факт выполненных работ. <br />
            Исполнитель не несёт ответственность за несоответствие параметрам гос. стандартов при <br />
            прохождении государственного технического осмотра. <br />
            Исполнитель имеет право на совершение фото и видео съёмки автомобиля, а так же на <br />
            управлени ТС для тех. целей
        </div>

        <div>
            Клиент обязуется забрать автомобиль в течение 24 часов с момента уведомления о завершении работ (по телефону, SMS, email или иным способом). <br/>
            В случае, если клиент не забирает автомобиль в указанный срок, взимается плата за парковку в размере 15 белорусских рублей в день.<br/>
            Мастерская не несёт материальной ответственности за повреждения, произошедшие на парковке (ДТП, угоны, стихийные бедствия и иные внешние воздействия).<br/>
            Клиент принимает на себя все риски, связанные с дальнейшим хранением автомобиля на территории мастерской.
        </div>

        <br/>
        <br/>

        <div>
            При наличии дефектов автомобиля, находящихся непосредственно в зоне проведения ремонтных работ, Заказчик обязан описать их ниже. <br />
            В случае обнаружения дефектов, влияющих на качественное выполнение работ, не указанных в документе, Исполнитель может взымать <br />
            дополнительную плату за их исправление, с уведомлением или без уведомления Заказчика. <br />
            ____________________________________________________________________
        </div>

        <br/>
        <br/>
        <br/>
    </>
);