import React from "react";

export const HeadlightActDescription = ({ customerData }) => (
    <>
            <div>
                Претензии не принимаются в случае не соблюдения заказчиком правил технической эксплуатации,
                дорожно-транспортного происшествия, при ремонте установленного агрегата, узла, детали, без
                предъявления ТС на предприятие автосервиса, а также в случае предъявления
                претензий после установленного срока. Гарантийный срок начинает исчисляться со дня приёмки
                потребителем ТС или агрегата. Предприятие не устанавливает гарантии на запчасти
                предоставленные заказчиком для ремонта, а так же на ремонт корпуса, креплений и стекла фары посредством пайки. <br/>
                Претензии по качеству и объему выполненных услуг по
                обслуживанию могут быть предъявлены заказчиком в течении следующих гарантийных сроков: <br/>
                - при условии разбора фары: на герметичность шва между стеклом и корпусом фары - в течение 365 дней при пробеге не более 50000
                км; <br/>
                {
                    customerData?.module && (
                        <div>
                            - установленные модули в фары ТС – {customerData.warranty || '-'} <br />
                            Модель модулей, установленных в фару ТС: – {customerData.module || 'не устанавливался'}
                        </div>
                    )
                }

                Для действия гарантии фара должна соответствовать заводским параметрам герметичности. <br/>
                При любом ДТП необходимо явиться к исполнителю для диагностики повреждений фар. <br/>
                При несоответствии фары эксплуатационным характеристикам, не связанными с работой Исполнителя,
                необходимо в срок до 14 дней исправить все имеющиеся недостатки и предоставить доказательства
                исправления исполнителю.
            </div>

            <br />
            <br />
            <br />
            <br />
            <br />
            <br />
    </>
);